[
  {
    "id": "q1",
    "text": "Pourquoi souhaites-tu partir à l’étranger ?",
    "hint": "Demande la priorité (académique/pro/perso) et un exemple concret."
  },
  {
    "id": "q2",
    "text": "Qu’aimerais-tu apprendre ou découvrir en priorité (langue, culture, autonomie, métier) ? Classe-les par ordre d’importance si tu le peux.",
    "hint": "Fais hiérarchiser (Top 3) et pourquoi le #1 est prioritaire."
  },
  {
    "id": "q3",
    "text": "S'il n'y avait aucune limite (budgétaire ou autre), dans quels pays ou régions te verrais-tu partir ? Pourquoi ?",
    "hint": "Creuse 1 choix : ce qui t’attire concrètement (vie étudiante, secteur, climat…)."
  },
  {
    "id": "q4",
    "text": "Quelle langue veux-tu pratiquer ou améliorer ? Quel est ton niveau actuel ? Ton niveau visé ?",
    "hint": "Une fois que tu as tes réponses sur la langue et les niveaux, mets l'élève dans une mini-situation immersive (ex: demander son chemin, discuter en soirée). Tu lui poses alors une question dans la langue cible, au niveau actuel. Si c'est trop dur pour lui, tu peux encore reposer 1 seule question plus simple, ensuite tu passes à la question suivante."
  },
  {
    "id": "q5",
    "text": "Tu préfères une culture proche ou un fort dépaysement ? Pourquoi ?",
    "hint": "Teste la fibre aventure : prêt à partir loin/longtemps ? motivations vs attache familiale."
  },
  {
    "id": "q6",
    "text": "Quel type de séjour te correspond le mieux : études, stage, volontariat, job, séjour linguistique, césure ? Et pour combien de temps ?",
    "hint": "Préciser durée (semaines/mois) et contexte idéal (campus, entreprise, ONG…)."
  },
  {
    "id": "q7",
    "text": "Souhaites-tu solliciter une bourse ?",
    "hint": "Si 'Oui' ou 'Je ne sais pas', lui demander s'il connaît déjà des systèmes de bourse ? Si oui, pour quelles raisons principales (financement partiel/total, critères).",
    "max_followups": 2,
    "skip_revisit": true
  },
  {
    "id": "q8",
    "text": "Quelles sont tes inquiétudes principales sur place ?",
    "hint": "Aides à la réponse : sécurité (individuelle, politique, climatique), confort, adaptation (à la vie dans le campus, extra-campus), solitude, santé (mentale, physique), démarches administratives sur place (carte étudiant, services de l’université qui seraient lents). Prioriser 1–2 inquiétudes + 1 piste de mitigation à valider."
  },
  {
    "id": "q9",
    "text": "Es-tu déjà parti.e à l’international ? Où, quand, dans quel cadre, combien de temps ? Qu’as-tu aimé, pas aimé, appris ?",
    "hint": "Si jamais parti, pourquoi, y a-t-il une raison particulière (financière, etc). Si oui, extraire 1 leçon actionnable pour le futur séjour."
  },
  {
    "id": "q10",
    "text": "Décris ton projet en une phrase : où, combien de temps, pour quoi faire.",
    "hint": "Aider à rendre la phrase plus spécifique (lieu+durée+objet)."
  }
]
